{"inkVersion":19,"root":[[{"->":"enter_study"},["done",{"#f":5,"#n":"g-0"}],null],"done",{"enter_study":[["^You just broke into the study. More of a library, really. Jim never actually closes himself in here, prefers somewhere with more sunshine and people to work. This room is always open to guests and, more importantly, the kids. He loves to support their reading habits. Makes sure the best stories are on the lower shelves.","\n","ev","str","^Try the door.","/str","/ev",{"*":".^.c-0","flg":4},"ev","str","^Try the window.","/str","/ev",{"*":".^.c-1","flg":4},{"c-0":[{"->":"its_locked"},"\n",{"#f":5}],"c-1":[{"->":"give_up"},"\n",{"#f":5}]}],{"#f":1}],"its_locked":["^The weird thing is, the door's locked. It's an old fashioned house, though you're no expert to ask whether that's by design or if it's actually old. But either way, it only locks with a key. And you can't swear to it, but you're pretty sure that key only works from the inside.","\n","^Not really sure how that makes sense when no one else is in here. It's not that big a room, and the whole area is eerily quiet. You'd be able to hear someone breathing even if they didn't object to you sliding in after ringing the front doorbell and finding every entry locked.","\n","^The breeze from the window behind you stirs the curtains and you very carefully don't think about reasons someone might have left through the window in the back of the house, leaving it unlocked and abandoned. You very carefully think \"someone,\" not \"Jim.\"","\n",{"->":"look_around"},{"#f":1}],"look_around":[["^It's not a very large room. There can't be that many places to hide a key.","\n","ev","str","^Examine the desk.","/str","/ev",{"*":".^.c-0","flg":4},"ev","str","^Examine the bookshelves behind the desk.","/str","/ev",{"*":".^.c-1","flg":4},"ev","str","^Examine the shelves by the couch.","/str","/ev",{"*":".^.c-2","flg":4},"ev","str","^Start for the window.","/str","/ev",{"*":".^.c-3","flg":4},{"c-0":[{"->":"desk"},"\n",{"#f":5}],"c-1":["^ ",{"->":"shelves_desk"},"\n",{"#f":5}],"c-2":[{"->":"shelves_couch"},"\n",{"#f":5}],"c-3":[{"->":"give_up"},"\n",{"#f":5}]}],{"#f":1}],"desk":["^The desk really wants an exit strategy.","\n","end",{"#f":1}],"shelves_desk":[["ev","str","^Look around some more.","/str","/ev",{"*":".^.c-0","flg":4},{"c-0":["^ ",{"->":"look_around"},"\n",{"#f":5}]}],{"#f":1}],"shelves_couch":[["^The bookshelves near the couch ",["ev","visit",1,"MIN","/ev","ev","du",0,"==","/ev",{"->":".^.s0","c":true},"ev","du",1,"==","/ev",{"->":".^.s1","c":true},"nop",{"s0":["pop","^hold the cream of the crop, to ensure that whenever Lilly joins her dad in here she'll have something enticing in view.",{"->":".^.^.17"},null],"s1":["pop","^stare back at you.",{"->":".^.^.17"},null],"#f":5}],"\n","ev","str","^Check low.","/str","/ev",{"*":".^.c-0","flg":4},"ev","str","^Check in the middle.","/str","/ev",{"*":".^.c-1","flg":4},"ev","str","^Check higher up.","/str","/ev",{"*":".^.c-2","flg":4},"ev","str","^Look around some more.","/str","/ev",{"*":".^.c-3","flg":4},{"c-0":["^ ",{"->":".^.^.^.shelves_couch_low"},"\n",{"#f":5}],"c-1":["^ ",{"->":".^.^.^.shelves_couch_mid"},"\n",{"#f":5}],"c-2":["^ ",{"->":".^.^.^.shelves_couch_high"},"\n",{"#f":5}],"c-3":["^ ",{"->":"look_around"},"\n",{"#f":5}]}],{"shelves_couch_low":["^Fricking third time writing this. And I'm tired, just getting the story out before morning.","\n","^Lilly's favorite picture book is missing, which isn't a surprise since she's been using it to help herself and her brother get out of \"moods.\" Caught the phrase from preschool. Declares herself in a mood when she's getting frustrated by something and spends time alone. Cheered her brother up with this book when he was crying while you were babysitting.","\n","^Sometimes you wish you'd had a big sister like her, but as it is you're proud of both of these kids like they were your own younger siblings. And so help you if something's happened to them...","\n","^There's nothing under the books. Or behind the books. Or able to be shaken out of the books.","\n","^Frustrated, you take a step back and keep your hands carefully by your sides, clenched into fists.","\n",{"->":".^.^"},{"#f":1}],"shelves_couch_mid":["^The whole reference section is conspicuously lacking dust in front of the books. The thesaurus especially is worn, the metallic edges flaked off around the corners from frequent use. You hoped to find a recess carved into the thicker tomes here, but the fact is Jim wouldn't be willing to risk facing life without the wisdom of every volume of The Books of Knowledge and An American Encyclopedia of Birds.","\n","^That is, assuming you know the man at all.","\n","^You check each book anyway. There's nothing.","\n",{"->":".^.^"},{"#f":1}],"shelves_couch_high":["^You climb the couch first to check the layer of dust on the upper shelves. It had probably been accumulating since you last spent a naptime tidying in here. Cleaning isn't part of your job and it isn't one of Jim's many interests. He keeps the living areas safe and sanitary but, when it comes to dusting, if it's out of sight it's never been in mind.","\n","^The late afternoon sun streaming in the window highlights the signs of how completely undisturbed these shelves have been. The curtains are still occasionally shifting in the breeze, drawing your eyes that way and you once again count your blessings that Jim installed a sturdy privacy fence between his backyard and the street. It was easy enough to clamber over, but all you can see over it from here is the tops of the fancy globe streetlamps from this side of town.","\n","^Even Jim's neighborhood is old fashioned. You're pretty sure there's a drink called old fashioned, and if so Jim probably drinks it. You are what you eat.","\n","^You sigh and step down from the couch's arm. Evidently you eat \"stalling.\"","\n",{"->":".^.^"},{"#f":1}],"#f":1}],"give_up":[[["ev","visit",1,"MIN","/ev","ev","du",0,"==","/ev",{"->":".^.s0","c":true},"ev","du",1,"==","/ev",{"->":".^.s1","c":true},"nop",{"s0":["pop","^You consider hopping back out the window, sliding it closed, and pretending none of this happened. But y",{"->":".^.^.17"},null],"s1":["pop","^Y",{"->":".^.^.17"},null],"#f":5}],"^ou won't give up on these kids that easily. There has to be something you can do here.","\n","ev","str","^Buck up.","/str",{"CNT?":"its_locked"},"!","/ev",{"*":".^.c-0","flg":5},"ev","str","^Take a deep breath.","/str",{"CNT?":"its_locked"},"/ev",{"*":".^.c-1","flg":5},{"c-0":["^ ",{"->":"its_locked"},"\n",{"#f":5}],"c-1":["^ ",{"->":"look_around"},"\n","end",{"#f":5}]}],{"#f":1}],"#f":1}],"listDefs":{}}